[
    {
      "name": "English",
      "direction": "ltr",
      "locale_symbol": "en",
      "default": true,
      "keywords": {
        "id": "id",
        "info": "info",
        "We shape your business ideas into reality and offer solutions which add value to your business.": "We shape your business ideas into reality and offer solutions which add value to your business"
      }
    },
    {
      "name": "Persian",
      "direction": "rtl",
      "locale_symbol": "fa",
      "default": false,
      "keywords": {
        "id": "شناسه",
        "info": "اطلاعات"
      }
    },
    {
      "name": "German",
      "direction": "ltr",
      "locale_symbol": "de",
      "default": false,
      "keywords": {
        "username": "Benutzername",
        "password": "Passwort",
        "IDEA": "IDEE",
        "PLAN": "PLANUNG",
        "DEVELOPMENT": "ENTWICKLUNG",
        "TESTING": "TEST",
        "DELIVERY": "LIEFERUNG",
        "We shape your business ideas into reality and offer solutions which add value to your business.": "Wir setzen Ihre Geschäftideen in die Tat um und liefern Lösungen, die Ihrem Unternehmen einen größeren Mehrwert bieten können.",
        "We create innovative & attractive web design with great functionality to engage web traffic.": "Wir entwerfen innovatives & attraktives Web-Design mit hervorragender Funktionalität, um Webverkehr zu vergrößern.",
        "We offer specialized web development services which are functional & give a phenomenal performance.": "Unsere Webentwicklungsservices sind funktionsstark und liefern eine überragende Leistung.",
        "Our expert team executes comprehensive testing before approval.": "Unsere Experten führen umfassende Teste vor einer endgültigen Bestätigung durch.",
        "We deliver final product with utmost adherence to quality, time and efficiency.": "Wie liefern Produkte mit einem Höchstmaß an Konformität, Qualität und Effizienz.",
        "Technical Manager": "",
        "Next": "Nächste",
        "Previous": "Zurück",
        "End": "Ende",
        "Our Process": "Unser Prozess",
        "Our Toolbox": "Unsere Toolbox",
        "Ready to start a project?": "Bereit für ein neues Projekt?",
        "Your name": "Ihr Name",
        "Your phone number": "Ihre Telefonnummer",
        "Your Email":"Ihre Email",
        "Content": "Ihre Nachricht",
        "Send your message": "Nachricht senden",
        "Get in touch with us": "Kontaktieren Sie uns",
        "About us": "Über uns",
        "Software Development": "Software-Entwicklung",
        "Web Development": "Web-Entwicklung",
        "Technical Support": "Technischer Support",
        "© 2018 Bent Oak Systems. All rights reserved.": "© 2018 Bent Oak Systems. Alle Rechte vorbehalten.",
        "Show Less": "Weniger anzeigen",
        "Show More": "Mehr anzeigen",
        "Who we are": "Wer wir sind",
        "LinkedIn Profile": "LinkedIn Profil",
        "Pros/Cons": "Pro/Contra",
        "Pricing": "Preisgestaltung",
        "Total cash price": "Summe", 
        "Total equity comp.": "Gesamtkapitalvergleich",
        "Contact us to start": "Kontaktieren Sie uns",
        "Cost": "Kosten",
        "Our Projects": "Unsere Projekte",
        "All projects": "Alle Projekte",
        "More...": "Weiterlesen...",
        "Follow us": "Folgen Sie uns",
        "Bent Oak Systems was founded in summer 2016 in London, UK. \n\nAt the time we were a few professionals working for big international corporates, and as it happens, every time we met one of us had some exciting idea about a new app. But we lacked a *production line* for the ideas, and the contractors we found were either expensive or low-quality (and in both cases: not affordable).\n\nWe decided to create *the production line*, and after a few months we had a quality team, and followed the best practice to have a standard *procedure* too: to make our *line* reusable for any new idea.\n\n### Our ideals are:\n0. To find talent, educate it and help them to thrive, and grow with them.\n0. To use best of breed of technologies for each purpose, particularly to use more productive and *connected* ways of software production.\n0. To focus on software quality - though we can be agile and deliver the results, our preference is to deliver high quality, well-thought, well-designed and extensively-tested code.\n\nOur team nurtured on these ideals and strives to achieve them.": "",
        "We are committed to *Continuous Integration*: to keep code integrity with a multi-branch (git) repository, with automated tests, PR reviews, manual tests and frequent internal demos. We use *de facto standards* for the purpose, like **[GitHub](https://github.com/bentoaksystems)** as our repository.\n\nWe strive to *deliver the product continuously*: to re-deploy for every minor change in an isolated environment for *Quality Assurance* for manual tests by ourselves and the client, to re-run all the tests as soon as a change is committed to the main branch of code and automate the whole deployment process based on well-defined triggers and pipelines. For this goal we use standard tool-set like **[Docker](https://docker.io)** for container management and environment isolation on the development box, and **[Jenkins](https://jenkins.io)** for automated and monitored DevOps.": "",
        "Today the systems, their users and their sources of data are more and more distributed. Everyone and everything is now expected to be live on the Internet (**web** or **IoT**), and they need to be served by powerful servers to receive, process and store their data, to receive and emit notifications where required and to provide well-formed summaries of the information overload.\n\nA useful software, whether for an enterprise or an individual, needs to address this connected world. Therefore software has become more like **apps**: with a *reactive* logic on a connected server, with modularised Application Programming Interfaces **(APIs)** that can be connected to and consumed as a **microservices** by other servers, and with *loose-coupling* to a web or mobile app interface that can be interchangeably used by the users.\n\nWe gained considerable expertise in designing, implementing and deployment of software in this way, and we have had satisfied clients in enterprise level.": "",
        "Software ages like the live beasts, and without well-thought prospect of training, support, maintenance and occasional upgrades, it will die soon, or worse, it will be stillborn.\n\nThe product launch day is the end of an intense development period for the programmers, but it is just the first day of 'release to production', when the product owner starts using it and usually needs 24/7 support. \n\nWe offer an Server Level Agreement **(SLA)** to our clients: the support starts with training, to help the owner understand and become skillful in using the new tool.\n\nIt continues with active monitoring of the servers. An open channel is designated for the client to send feedbacks in form of bug-reporting or request of new features, and push-buttons to sound the sirens for the costly incidents like server failures and possible data loss or leaks.\n\nThe channels are complimented with phone-calls, on-screen sessions, on-site presence and face to face chats to understand the issue and resolve it faster.\n\nWe take support of our products seriously. The development job is a long-term commitment, so we write the code and error-handling to be supportable and clear to solve. We test the code under simulations of the real use cases, to make sure it is okay - but as long as there is code, there is bug and issues, and they must be addressed as rigorously - if not more.": "",
        "About Bent Oak Systems": "Über Bent Oak Systems",
        "Bent Oak Systems,CI/CD,Web Development,Software Development,Technical Support": "Bent Oak Systems,CI/CD,Web Entwicklung,Software Entwicklung,Technische Unterstützung",
        "footer contents": "Fußzeileninhalt",
        "Contact": "Kontakt",
        "People": "Unser Team",
        "Projects": "Projekte",
        "Home": "Startseite",
        "Bent Oak Systems was founded in summer 2016 in London, UK.": "Bent Oak Systems wurde 2016 in London, UK gegründet.",
        "We are committed to Continuous Integration: to keep code integrity with a multi-branch (git) repository.": "Wir verpflichten uns zu einer kontinuierlichen Integration anhand git.",
        "Today the systems, their users and their sources of data are more and more distributed.": "Aktuell sind Systeme, deren Benutzer, sowie deren Datenquellen immer mehr verbreitet.",
        "Your business web site can be your fingerprint, your business card, your showroom and your marketplace.": "Ihre Website könnte Ihre Identität, Ihre Visitenkarte, Ihr Showroom und Ihr Marktplatz sein.",
        "Software ages like the live beasts, and without well-thought prospect of training, support, maintenance ...": "Ein Softwaresystem kann ohne Training, Support und Wartung nicht Instand gehalten werden.",
        "Intern": "PraktikantIn",
        "Full-stack Developer": "Full-Stack Entwickler",
        "Full-Stack Developer / SEO": "Full-Stack Entwickler / SEO",
        "Full-Stack Developer / Test Automation": "Full-Stack Entwickler / Testautomatisierung",
        "Business Consultant": "Business Consultant",
        "Founder / CEO": "Gründer / CEO",
        "Fully Remote": "Völlig remote",
        "Our most affordable plan": "Unser bezahlbarstes Angebot", 
        "Ideal for experienced software project managers": "Optimal für erfahrene Projektmanager in der Software-Branche",
        "complete with remote control toolset: JIRA, Jenkins and Slack": "Völlig remote mit Hilfe der Fernbedienungswerkzeuge: JIRA, Jenkins und Slack",
        "Three months free support after handover": "Drei Monate lang kostenfreie Unterstützung nach der Übergabe",
        "Lack of face-to-face communication, except for video chats": "Fehlende Face-to-Face Kommunikation außer bei Videoanrufen",
        "Timezone difference": "Zeitzonendifferenz",
        "Not for the people who are not technically well-versed": "Nicht geeignet für technisch nicht versierte Personen",
        "Leveraged On-site Contract": "Fremdfinanzierter vor Ort Vertrag",
        "Employing an experienced (8+yrs) contractor who leads a remote team of 3 full-time developers": "Anstellung eines erfahrenen Dienstleisters (8+yrs), der ein Remote-Team aus 3 Vollzeit-Entwicklern führt",
        "Engage in architecture and design of software from the beginning": "Beteiligung an der Architektur und dem Design der Software gleich von Anfang an",
        "No communication barrier": "Kein Kommunikationshindernis",
        "No communication barriers": "Keine Kommunikationshindernisse",
        "Ideal for green-field projects": "Ideal für Greenfield-Projekte",
        "Help to build your own team": "Unterstützung bei Ihrer Teamentwicklung",
        "Needs a substantial budget": "Erfordert ein erhebliches Budget",
        "Remote Technical Acceleration": "",
        "Less strain on your cash-flow": "Geringere Belastung Ihres Cashflow",
        "Only for the businesses that WE LIKE TO BE THEIR SHAREHOLDERS": "Ausschließlich für Unternehmen, bei denen wir gerne Aktien besitzen möchten",
        "Local Technical Acceleration": "",
        "Partnership with an experienced (8+yrs) contractor who leads a remote team of 3 full-time developers": "Partnerschaft mit einem erfahrenen Dienstleister (8+yrs), der ein Remote-Team aus 3 Vollzeit-Entwicklern führt",
        "Ideal for start-ups who need an MVP or POC": "Optimal für Startups, die ein MVP oder POC benötigen",
        "Attendance and demos in your meetings with investors": "Teilnahme an Meetings mit Ihren Investoren und durchführung von Präsentationen",
        "Needs more budget": "Erfordert mehr Budget",
        "\n Burgista needed a timesheet app with some specific features they couldn't find in other personnel time management systems.\n \n This was our first project, using angular 2 (still in beta version at the time) and Node.js.\n": "\n Ein Zeiterfassungsapplikation mit einigen spezifischen Features wurde für Burgista entwickelt. Diese spezifische Features sind in anderen Personalmanagement-Systemen nicht verfügbar.\n\n Das war unser erstes Projekt mit Angular 2 (zu diesem Zeitpunkt noch in der Beta-Version) und Node.js.\n",
        "Burgista Timesheet": "Burgista Timesheet",
        "Web-based timesheet": "Webbasiertes Zeiterfassungssystem",
        "\n Managers need to plan and they want to detect diversions from their plans early rather than late.\n \n This app is under development, and will help to store the initial plan based on financial statements and KPIs and find the diversions as soon as they happen.\n": "",
        "Planning and Budgeting App For Aria Teb": "Planungs- und Budget-App für Aria-Teb",
        "Financial Planning and Diversion Detection": "Finanzplanung",
        "\n There is a tradition to read whole Quran for getting God's help in one's life or for asking forgiveness for recently deceased people. As it takes a long time for one person to read all Quran, it is also done in group readings.\n \nWe developed an app to help with the group readings of Quran, also to present the text in a minimal, legible and beautiful way \n": "",
        "Quran Together App": "Quran Together App",
        "Social reading of Quran, on iOS and Android": "Social-Reading des Korans auf iOS und Android",
        "Quran": "Koran",
        "\n The clinic of Dr Mandegar, one of the most recognised cardiac surgeons in the country, needed to keep patients' records electronically. The problem was that the doctors did not like to type their comments after examination and preferred traditional handwriting. \n \n We built a system that could import scanned files as well as files generated by Livescribe smartpens. The system also consists of a live queue visible by all doctors, and an internal chat window. \n": "",
        "Dr Mandegar's Electronic Medical Record App": "App für elektronische Erfassung der Patientendaten für Dr. Mandegar",
        "Electronic Medical Records": "Elektronische Patientenakten",
        "\n Burgista needed to manage inventory over their expanding number of branches. The products should be counted in inventory within specific periods of time and for the ones with a count below a limit an automatic order should be placed for internal delivery from the party responsible for that product (Main Depot or Prep Kitchen).\n \n This project was done as an angular 2 app with Node.JS server and PostgreSQL database.\n": "",
        "Burgista Internal Delivery App": "Interne Lieferservice-App für Burgista",
        "Inventory and delivery management for a gourmet fast-food chain": "Inventar- und Lieferungsmanagement für eine Fast-Food-Kette",
        "Now the most popular programming language that can be used in the Web (its birthplace) as well as in any other application.": "",
        "Node.js is a platform built on Chrome's JavaScript runtime for building fast and scalable network applications, providing a rich library of JS modules.": "",
        "The favourite NoSQL database that matches perfectly with data paradigm of JavaScript (JSON) and suits large-scale non-structured data sources.": "",
        "One of the best open source relational database management systems, PostgreSQL is a reliable tool for storage and retrieval of structured data.": "",
        "It is JavaScript with strong typing, that makes it tidier and more manageable in big projects. Invented in Microsoft and supported by Google.": "",
        "Angular is a JavaScript platform (with TypeScript and better modularity after version 2). Created by Google to build applications with the web.": "",
        "Jenkins is a self-contained Java-based program, ready to run out-of-the-box, with packages for Windows, Mac OS X and other Unix-like operating systems.": "",
        "Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications, whether on laptops, data center VMs, or the cloud.": "",
        "Jira Software is an agile project management tool that supports any agile methodology, be it scrum, kanban, or your own unique flavor.": "",
        "Redis is an open source (BSD licensed), in-memory data structure store, used as a database, cache and message broker.": "",
        "Git is a free and open source distributed version control system designed to handle everything in most projects with speed and efficiency.": "",
        "Slack is a place where your team comes together to collaborate, important information can be found by the right people..": "",
        "Heroku is a cloud platform that lets companies build, deliver, monitor and scale apps, we're the fastest way to go from idea to URL.": ""
      }
    }
  ]
  