[
  {
    "name": "English",
    "direction": "ltr",
    "locale_symbol": "en",
    "default": true,
    "keywords": {
      "id": "id",
      "info": "info"
    }
  },
  {
    "name": "German",
    "direction": "ltr",
    "locale_symbol": "de",
    "default": false,
    "keywords": {
      "username": "Benutzername",
      "password": "Passwort",
      "IDEA": "IDEE",
      "PLAN": "PLANUNG",
      "DEVELOPMENT": "ENTWICKLUNG",
      "TESTING": "TEST",
      "DELIVERY": "LIEFERUNG",
      "We shape your business ideas into reality and offer solutions which add value to your business.": "Wir setzen Ihre Geschäftideen in die Tat um und bieten Lösungen, die Ihrem Unternehmen einen Mehrwert verleihen.",
      "We create innovative & attractive web design with great functionality to engage web traffic.": "Wir entwerfen innovatives und attraktives Webdesign mit großartigen Funktionen, um den Webverkehr zu fördern.",
      "We offer specialized web development services which are functional & give a phenomenal performance.": "Unsere Webentwicklungsservices sind funktionsstark und liefern eine überragende Leistung.",
      "Our expert team executes comprehensive testing before approval.": "Unsere Experten führen vor einer Genehmigung umfassende Tests durch.",
      "We deliver final product with utmost adherence to quality, time and efficiency.": "Wir liefern das Endprodukt unter Einhaltung von Qualität, Zeitplan und Effizienz.",
      "Technical Manager": "Technical Manager",
      "days": "Tage",
      "months": "Monate",
      "quarters": "Quartale",
      "support hours": "Support-Stunden",
      "support months": "Support-Monate",
      "Next": "Nächste",
      "Previous": "Zurück",
      "End": "Ende",
      "Our Process": "Unser Prozess",
      "Our Toolbox": "Unsere Toolbox",
      "Ready to start a project?": "Bereit für ein neues Projekt?",
      "Your name": "Ihr Name",
      "Your phone number": "Ihre Telefonnummer",
      "Your Email":"Ihre Email",
      "Content": "Ihre Nachricht",
      "Send your message": "Nachricht senden",
      "Get in touch with us": "Kontaktieren Sie uns",
      "About us": "Über uns",
      "Software Development": "Software-Entwicklung",
      "Web Development": "Web-Entwicklung",
      "Technical Support": "Technischer Support",
      "© 2018 Bent Oak Systems. All rights reserved.": "© 2018 Bent Oak Systems. Alle Rechte vorbehalten.",
      "Show Less": "Weniger anzeigen",
      "Show More": "Mehr anzeigen",
      "Who we are": "Wer wir sind",
      "LinkedIn Profile": "LinkedIn Profil",
      "Pros/Cons": "Pro/Contra",
      "Pricing": "Preisgestaltung",
      "Total cash price": "Summe", 
      "Total equity comp.": "Gesamtkapitalvergleich",
      "Contact us to start": "Kontaktieren Sie uns",
      "Cost": "Kosten",
      "Our Projects": "Unsere Projekte",
      "All projects": "Alle Projekte",
      "More...": "Weiterlesen...",
      "Follow us": "Folgen Sie uns",
      "Bent Oak Systems was founded in summer 2016 in London, UK. /n/nAt the time we were a few professionals working for big international corporates, and as it happens, every time we met one of us had some exciting idea about a new app. But we lacked a *production line* for the ideas, and the contractors we found were either expensive or low-quality (and in both cases: not affordable)./n/nWe decided to create *the production line*, and after a few months we had a quality team, and followed the best practice to have a standard *procedure* too: to make our *line* reusable for any new idea./n/n### Our ideals are:/n0. To find talent, educate it and help them to thrive, and grow with them./n0. To use best of breed of technologies for each purpose, particularly to use more productive and *connected* ways of software production./n0. To focus on software quality - though we can be agile and deliver the results, our preference is to deliver high quality, well-thought, well-designed and extensively-tested code./n/nOur team nurtured on these ideals and strives to achieve them.": "Bent Oak Systems wurde im Sommer 2016 in London, UK, gegründet. /n/nZu dieser Zeit bestand unser Team aus einigen Profis, die für große internationale Unternehmen arbeiteten. Und jedes Mal, wenn wir uns getroffen haben, hatte einer von uns eine aufregende Idee für eine neue App. Es fehlte uns jedoch ein Produzent für unsere Ideen. Auch die Auftragnehmer, die wir fanden, waren entweder teuer oder deren Ergebnisse hatten keine gute Qualität. In beiden Fällen wäre dies für uns nicht lohnenswert gewesen./n/nWir haben uns demnach entschlossen, die Produktion selber zu erstellen. Nach einigen Monaten hatten wir bereits ein Qualitätsteam und nutzten unser Erfolgsrezept, um auch ein Standardverfahren zu entwickeln. Dies lautete: unser Sortiment für jede neue Idee wiederverwendbar zu machen./n/n### Unsere Ideale sind:/n0. Um Talente zu finden, bilden Sie sie aus und helfen Sie ihnen, erfolgreich zu sein und mit Ihnen zu wachsen./n0. Einsatz der besten Technologien für jeden Zweck, insbesondere um produktivere und vernetztere Methoden der Softwareproduktion zu nutzen./n0. Konzentration auf die Softwarequalität - obwohl wir schnell sind und die Ergebnisse in kurzer Zeit liefern können, bevorzugen wir es, qualitativ hochwertige, durchdachte, gut gestaltete und ausführlich getestete Programmierarbeit zu liefern./n/nUnser Team hat diese Ideale gefördert und ist bestrebt, diese zu erreichen.",
      "We are committed to *Continuous Integration*: to keep code integrity with a multi-branch (git) repository, with automated tests, PR reviews, manual tests and frequent internal demos. We use *de facto standards* for the purpose, like **[GitHub](https://github.com/bentoaksystems)** as our repository./n/nWe strive to *deliver the product continuously*: to re-deploy for every minor change in an isolated environment for *Quality Assurance* for manual tests by ourselves and the client, to re-run all the tests as soon as a change is committed to the main branch of code and automate the whole deployment process based on well-defined triggers and pipelines. For this goal we use standard tool-set like **[Docker](https://docker.io)** for container management and environment isolation on the development box, and **[Jenkins](https://jenkins.io)** for automated and monitored DevOps.": "Wir verpflichten uns zur *kontinuierlichen Integration*: Wahrung der Code-Integrität mit einem Multi-Branch (Git) -Repository mit automatisierten Tests, PR-Überprüfungen, manuellen Tests und häufigen internen Demos. Für diesen Zweck verwenden wir Industriestandards wie **[GitHub](https://github.com/bentoaksystems)** als Speicher./n/nWir sind bestrebt, *das Produkt fortlaufend zu liefern*: bei jeder geringfügigen Änderung in einer isolierten Umgebung zur *Qualitätssicherung* für manuelle Tests durch uns und den Kunden erneut bereitzustellen und alle Tests erneut auszuführen, sobald eine Code-Änderung in der Hauptniederlassung vorgenommen wurde. Zudem automatisieren wir den gesamten Bereitstellungsprozess basierend auf genau definierten Triggern und Pipelines. Für dieses Ziel verwenden wir Standard-Tool-Sets wie **[Docker](https://docker.io)** für die Container-Management und Umgebungsisolierung auf der Development-Bos und **[Jenkins](https://jenkins.io)** für automatisierte und überwachte DevOps.",
      "Today the systems, their users and their sources of data are more and more distributed. Everyone and everything is now expected to be live on the Internet (**web** or **IoT**), and they need to be served by powerful servers to receive, process and store their data, to receive and emit notifications where required and to provide well-formed summaries of the information overload./n/nA useful software, whether for an enterprise or an individual, needs to address this connected world. Therefore software has become more like **apps**: with a *reactive* logic on a connected server, with modularised Application Programming Interfaces **(APIs)** that can be connected to and consumed as a **microservices** by other servers, and with *loose-coupling* to a web or mobile app interface that can be interchangeably used by the users./n/nWe gained considerable expertise in designing, implementing and deployment of software in this way, and we have had satisfied clients in enterprise level.": "Heute sind die Systeme, ihre Benutzer und ihre Datenquellen immer mehr verteilt. Es wird erwartet, dass jeder und alles sofort im Internet (**Web** oder **IoT**) verfügbar ist. Hierfür müssen leistungsstarke Server bedient werden, um Daten zu empfangen, zu verarbeiten und zu speichern. Bei Bedarf müssen Benachrichtigungen empfangen und gesendet werden, sowie ein ausführlicher Überblick über die Informationsüberlastung bereitgestellt werden./n/nEine nützliche Software, ob für ein Unternehmen oder eine Einzelperson, muss sich mit dieser vernetzten Welt befassen. Daher ähneln Software mehr und mehr **Apps**: mit einer *reaktionsfähigen* Verknüpfung auf einem verbundenen Server, mit modularisierten Application Programming Interfaces **(APIs)**, die mit anderen Servern verbunden und als **Microservices** verwendet werden können, und mit *loser Kopplung* an eine Web- oder Mobile-App Schnittstelle, die von den Benutzern abwechselnd verwendet werden kann./n/nWir haben auf diese Weise beträchtliches Know-how beim Entwerfen, Implementieren und Bereitstellen von Software erworben und hatten bereits viele zufriedene Kunden auf Unternehmensebene.",
      "Software ages like the live beasts, and without well-thought prospect of training, support, maintenance and occasional upgrades, it will die soon, or worse, it will be stillborn./n/nThe product launch day is the end of an intense development period for the programmers, but it is just the first day of 'release to production', when the product owner starts using it and usually needs 24/7 support. /n/nWe offer an Server Level Agreement **(SLA)** to our clients: the support starts with training, to help the owner understand and become skillful in using the new tool./n/nIt continues with active monitoring of the servers. An open channel is designated for the client to send feedbacks in form of bug-reporting or request of new features, and push-buttons to sound the sirens for the costly incidents like server failures and possible data loss or leaks./n/nThe channels are complimented with phone-calls, on-screen sessions, on-site presence and face to face chats to understand the issue and resolve it faster./n/nWe take support of our products seriously. The development job is a long-term commitment, so we write the code and error-handling to be supportable and clear to solve. We test the code under simulations of the real use cases, to make sure it is okay - but as long as there is code, there is bug and issues, and they must be addressed as rigorously - if not more.": "Software unterliegt einem Alterungsprozess wie z. B. Lebewesen. Ohne passende Aussichten auf Schulung, Unterstützung, Wartung und gelegentliche Aktualiesierung wird diese bald sterben oder noch schlimmer, sie wird sogar tot geboren./n/nDer Tag der Produkt-Einführung ist das Ende einer intensiven Entwicklungsphase für die Programmierer. An diesem Tag wird das Produkt an den Kunden freigegeben, jedoch ist die Arbeit hier noch nicht beendet, denn gleichzeitig beginnt auch die permanente Unterstützung des Kunden bei der Bedienung der Applikation. /n/nWir bieten unseren Kunden ein „Server Level Agreement **(SLA)**“ an: Der Support beginnt mit Schulungen, durch die der Kunde sich mit dem Bedienen des Produktes vertraut machen kann./n/nAnschließend folgt die permanente Überwachung der Server. Für den Clienten ist ein offener Kanal vorgesehen, über den sie Nachrichten in Form von Fehlerberichten oder Anforderungen zur Erstellung neuer Features senden können, sowie ein Push-Button, der kostenintensive Störfälle wie Serverausfälle, Datenverluste und –leck berichtet./n/nDie Kanäle werden vervollständigt durch Telefonanrufe, On-Screen-Sitzungen, Präsenz vor Ort und persönliche Chats, um das Problem zu erkennen und dieses mölichst schnell zu lösen./n/nWir achten stets auf eine optimale Qualität unseres Supports. Der Entwicklungsjob ist eine langfristige Verpflichtung, daher schreiben wir den Code und die Fehlerbehandlung so, dass die Fehlererkennung bzw. Fehrbehebung leichter durchgeführt werden kann. Wir testen den Code durch Simulationen in der realen Anwendung, um sicherzustellen, dass das Programm einwandfrei funktioniert - aber solange es Codes gibt, wird es auch Fehler und Probleme mit diesen geben. Das Ziel ist es daher, diese schneller und gründlicher zu lösen als je zuvor.",
      "About Bent Oak Systems": "Über Bent Oak Systems",
      "Bent Oak Systems,CI/CD,Web Development,Software Development,Technical Support": "Bent Oak Systems,CI/CD,Web Entwicklung,Software Entwicklung,Technische Unterstützung",
      "footer contents": "Fußzeileninhalt",
      "Contact": "Kontakt",
      "People": "Unser Team",
      "Projects": "Projekte",
      "Home": "Startseite",
      "Bent Oak Systems was founded in summer 2016 in London, UK.": "Bent Oak Systems wurde im Sommer 2016 in London, UK gegründet.",
      "We are committed to Continuous Integration: to keep code integrity with a multi-branch (git) repository.": "Wir verpflichten uns zur kontinuierlichen Integration anhand git: um die Code-Integrität mit einem Git-Repository mit mehreren Zweigen zu gewährleisten.",
      "Today the systems, their users and their sources of data are more and more distributed.": "Aktuell werden Systeme, ihre Benutzer und ihre Datenquellen immer mehr verteilt.",
      "Your business web site can be your fingerprint, your business card, your showroom and your marketplace.": "Ihre Business-Website kann Ihr Fingerabdruck, Ihre Visitenkarte, Ihr Showroom und Ihr Marktplatz sein.",
      "Software ages like the live beasts, and without well-thought prospect of training, support, maintenance ...": "Ein Softwaresystem kann ohne Training, Support und Wartung nicht Instand gehalten werden.",
      "Intern": "PraktikantIn",
      "Full-stack Developer": "Full-Stack Entwickler",
      "Full-Stack Developer / SEO": "Full-Stack Entwickler / SEO",
      "Full-Stack Developer / Test Automation": "Full-Stack Entwickler / Testautomatisierung",
      "Business Consultant": "Business Consultant",
      "Founder / CEO": "Gründer / CEO",
      "Fully Remote": "Völlig remote",
      "Our most affordable plan": "Unser günstigster Plan", 
      "Ideal for experienced software project managers": "Optimal für erfahrene Projektmanager in der Software-Branche",
      "complete with remote control toolset: JIRA, Jenkins and Slack": "Völlig remote mit Hilfe der Fernbedienungswerkzeuge: JIRA, Jenkins und Slack",
      "Three months free support after handover": "Drei Monate kostenlose Unterstützung nach Übergabe",
      "Lack of face-to-face communication, except for video chats": "Fehlende persönliche Kommunikation, außer bei Videochats",
      "Timezone difference": "Zeitzonendifferenz",
      "Not for the people who are not technically well-versed": "Nicht geeignet für technisch nicht versierte Personen",
      "Leveraged On-site Contract": "Fremdfinanzierter Vor-Ort-Vertrag",
      "Employing an experienced (8+yrs) contractor who leads a remote team of 3 full-time developers": "Anstellung eines erfahrenen Auftragnehmers (8+yrs), der ein Remote-Team aus 3 Vollzeit-Entwicklern leitet",
      "Engage in architecture and design of software from the beginning": "Beteiligung an der Architektur und dem Design der Software gleich von Anfang an",
      "No communication barrier": "Kein Kommunikationshindernis",
      "No communication barriers": "Keine Kommunikationshindernisse",
      "Ideal for green-field projects": "Ideal für Greenfield-Projekte",
      "Help to build your own team": "Unterstützung bei Ihrer Teamentwicklung",
      "Needs a substantial budget": "Erfordert ein beträchtliches Budget",
      "Remote Technical Acceleration": "Technische Beschl. - remote",
      "Local Technical Acceleration": "Technische Beschl. - lokal",
      "Less strain on your cash-flow": "Geringere Belastung Ihres Cashflow",
      "Only for the businesses that WE LIKE TO BE THEIR SHAREHOLDERS": "Ausschließlich für die Unternehmen, die wir gerne ihre Anteilseigner sein möchten",
      "Partnership with an experienced (8+yrs) contractor who leads a remote team of 3 full-time developers": "Partnerschaft mit einem erfahrenen Auftragnehmer (8+yrs), der ein Remote-Team aus 3 Vollzeit-Entwicklern leitet",
      "Ideal for start-ups who need an MVP or POC": "Optimal für Startups, die ein MVP oder POC benötigen",
      "Attendance and demos in your meetings with investors": "Teilnahme und Demos an Ihren Meetings mit Investoren",
      "Needs more budget": "Erfordert mehr Budget",
      "/n Burgista needed a timesheet app with some specific features they couldn't find in other personnel time management systems./n /n This was our first project, using angular 2 (still in beta version at the time) and Node.js./n": "/n Burgista benötigte eine Arbeitszeittabellen-App mit einigen spezifischen Funktionen, die sie in anderen Personalzeitmanagementsystemen nicht finden konnten./n /n Dies war unser erstes Projekt mit Angular 2 (zu diesem Zeitpunkt noch in der Beta-Version) und Node.js./n",
      "Burgista Timesheet": "Burgista Timesheet",
      "Web-based timesheet": "Webbasierte Arbeitszeittabelle",
      "/n Managers need to plan and they want to detect diversions from their plans early rather than late./n /n This app is under development, and will help to store the initial plan based on financial statements and KPIs and find the diversions as soon as they happen./n": "/n Manager möchten Abweichungen von ihren Plänen eher früh als spät erkennen./n /n Diese App befindet sich in der Entwicklungsphase und hilft dabei, den ursprünglichen Plan basierend auf Abschlüssen und KPIs zu speichern und die Planabweichungen zu finden, sobald sie eintreten./n",
      "Planning and Budgeting App For Aria Teb": "Planungs- und Budget-App für Aria-Teb",
      "Financial Planning and Diversion Detection": "Finanzplanung",
      "/n There is a tradition to read whole Quran for getting God's help in one's life or for asking forgiveness for recently deceased people. As it takes a long time for one person to read all Quran, it is also done in group readings./n /nWe developed an app to help with the group readings of Quran, also to present the text in a minimal, legible and beautiful way /n": "/n Es gibt eine Tradition, den gesamten Koran zu lesen, um Gottes Hilfe in seinem Leben zu erhalten oder um kürzlich Verstorbene um Vergebung zu bitten./n /n Da es lange dauert, bis eine Person den gesamten Koran gelesen hat, erfolgt dies auch in Gruppenlesungen. Wir haben eine App entwickelt, die bei den Gruppenlesungen des Korans hilft und den Text auf minimale, lesbare und schöne Weise präsentiert./n",
      "Quran Together App": "Quran Together App",
      "Social reading of Quran, on iOS and Android": "Gruppenlesung des Korans auf iOS und Android",
      "Quran": "Koran",
      "/n The clinic of Dr Mandegar, one of the most recognised cardiac surgeons in the country, needed to keep patients' records electronically. The problem was that the doctors did not like to type their comments after examination and preferred traditional handwriting. /n /n We built a system that could import scanned files as well as files generated by Livescribe smartpens. The system also consists of a live queue visible by all doctors, and an internal chat window. /n": "/n Die Klinik von Dr. Mandegar, einem der bekanntesten Herzchirurgen des Landes, musste die Patientenakten elektronisch führen. Das Problem war, dass die Ärzte ihre Kommentare nach der Untersuchung nicht gerne tippten und die traditionelle Handschrift bevorzugten. /n /n Wir haben ein System entwickelt, das sowohl gescannte als auch von Livescribe-Smartpens generierte Dateien importieren kann. Das System besteht außerdem aus einer Live-Warteschlange, die für alle Ärzte sichtbar ist, und einem internen Chat-Fenster. /n",
      "Dr Mandegar's Electronic Medical Record App": "App für elektronische Erfassung der Patientendaten für Dr. Mandegar",
      "Electronic Medical Records": "Elektronische Patientenakten",
      "/n Burgista needed to manage inventory over their expanding number of branches. The products should be counted in inventory within specific periods of time and for the ones with a count below a limit an automatic order should be placed for internal delivery from the party responsible for that product (Main Depot or Prep Kitchen)./n /n This project was done as an angular 2 app with Node.JS server and PostgreSQL database./n": "/n Burgista musste das Inventar über die wachsende Anzahl von Filialen hinweg verwalten. Die Produkte sollten innerhalb bestimmter Zeiträume im Inventar gezählt werden, und für Produkte mit einer Anzahl unterhalb eines Grenzwerts sollte eine automatische Bestellung für die interne Lieferung von der für dieses Produkt verantwortlichen Partei (Hauptdepot oder Vorbereitungsküche) aufgegeben werden./n /n Dieses Projekt wurde als Angular 2-App mit Node.JS-Server und PostgreSQL-Datenbank entwickelt./n",
      "Burgista Internal Delivery App": "Interne Lieferservice-App für Burgista",
      "Inventory and delivery management for a gourmet fast-food chain": "Bestands- und Liefermanagement für eine Fast-Food-Kette",
      "Now the most popular programming language that can be used in the Web (its birthplace) as well as in any other application.": "JavaScript ist zurzeit eine der beliebtesten Programmiersprachen, die sowohl im Web (Geburtsort) als auch in jeder anderen Computer-Anwendung verwendet werden kann.",
      "Node.js is a platform built on Chrome's JavaScript runtime for building fast and scalable network applications, providing a rich library of JS modules.": "Node.js ist eine serverseitige, event basierte JavaScript-Laufzeitumgebung, die für die Entwicklung von schnellen und skalierbaren Netzwerkanwendungen entwickelt wurde.",
      "The favourite NoSQL database that matches perfectly with data paradigm of JavaScript (JSON) and suits large-scale non-structured data sources.": "Der Favorit unter den NoSQL-Datenbanken, die perfekt zum Datenparadigma von JavaScript (JSON) passt und sich für große unstrukturierte Datenquellen eignet.",
      "One of the best open source relational database management systems, PostgreSQL is a reliable tool for storage and retrieval of structured data.": "Eines der besten relationalen Open Source-Datenbankverwaltungssysteme. PostgreSQL ist ein zuverlässiges Tool zum Speichern und Abrufen strukturierter Daten.",
      "It is JavaScript with strong typing, that makes it tidier and more manageable in big projects. Invented in Microsoft and supported by Google.": "Es ist eine Art JavaScript, bei dem Typen eine Rolle spielen. Das macht es ordentlicher und handlicher in großen Projekten. Es wurde von Microsoft erfunden und wird von Google unterstützt.",
      "Angular is a JavaScript platform (with TypeScript and better modularity after version 2). Created by Google to build applications with the web.": "Angular ist eine JavaScript-Plattform (mit TypeScript und einer verbesserten Modularität nach Version 2). Erstellt von Google zum Entwickeln von Anwendungen mit dem Web.",
      "Jenkins is a self-contained Java-based program, ready to run out-of-the-box, with packages for Windows, Mac OS X and other Unix-like operating systems.": "Jenkins ist ein eigenständiges Java-basiertes Programm, das out of the Box ausführbar ist, und Pakete für Windows, Mac OS X und andere Unix-ähnliche Betriebssysteme enthält.",
      "Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications, whether on laptops, data center VMs, or the cloud.": "Eine offene Plattform für Entwickler und Systemadministratoren zum Erstellen, Versenden und Ausführen verteilter Anwendungen, egal ob auf Laptops, Rechenzentrums-VMs oder in der Cloud.",
      "Jira Software is an agile project management tool that supports any agile methodology, be it scrum, kanban, or your own unique flavor.": "Jira Software ist ein agiles Projektmanagement-Tool, das jede agile Methodik unterstützt, sei es Scrum, Kanban oder Ihre eigene einzigartige Variante.",
      "Redis is an open source (BSD licensed), in-memory data structure store, used as a database, cache and message broker.": "Redis ist ein Open Source (BSD-lizenzierter) speicherinterner Datenstrukturspeicher, der als Datenbank-, Cache- und Nachrichtenbroker verwendet wird.",
      "Git is a free and open source distributed version control system designed to handle everything in most projects with speed and efficiency.": "Git ist ein kostenloses und Open Source verteiltes Versionskontrollsystem, das entwickelt wurde, um alles in den meisten Projekten schnell und effizient zu erledigen.",
      "Slack is a place where your team comes together to collaborate, important information can be found by the right people..": "Slack ist ein Ort, an dem Ihr Team zusammenkommt, um zusammenzuarbeiten. Wichtige Informationen können von den richtigen Personen gefunden werden.",
      "Heroku is a cloud platform that lets companies build, deliver, monitor and scale apps, we're the fastest way to go from idea to URL.": "Heroku ist eine Cloud-Plattform, mit der Unternehmen Apps erstellen, liefern, überwachen und skalieren können. Wir sind der schnellste Weg, um von der Idee zur URL zu gelangen."
    }
  }
]
