[
  {
    "title": "Bent Oak Systems",
    "background": "assets/images/bentoak-a.jpg",
    "description": "Bent Oak Systems was founded in summer 2016 in London, UK. /n/nAt the time we were a few professionals working for big international corporates, and as it happens, every time we met one of us had some exciting idea about a new app. But we lacked a *production line* for the ideas, and the contractors we found were either expensive or low-quality (and in both cases: not affordable)./n/nWe decided to create *the production line*, and after a few months we had a quality team, and followed the best practice to have a standard *procedure* too: to make our *line* reusable for any new idea./n/n### Our ideals are:/n0. To find talent, educate it and help them to thrive, and grow with them./n0. To use best of breed of technologies for each purpose, particularly to use more productive and *connected* ways of software production./n0. To focus on software quality - though we can be agile and deliver the results, our preference is to deliver high quality, well-thought, well-designed and extensively-tested code./n/nOur team nurtured on these ideals and strives to achieve them."
  },
  {
    "title": "CI/CD",
    "background": "assets/images/CICD-a.jpg",
    "description": "We are committed to *Continuous Integration*: to keep code integrity with a multi-branch (git) repository, with automated tests, PR reviews, manual tests and frequent internal demos. We use *de facto standards* for the purpose, like **[GitHub](https://github.com/bentoaksystems)** as our repository./n/nWe strive to *deliver the product continuously*: to re-deploy for every minor change in an isolated environment for *Quality Assurance* for manual tests by ourselves and the client, to re-run all the tests as soon as a change is committed to the main branch of code and automate the whole deployment process based on well-defined triggers and pipelines. For this goal we use standard tool-set like **[Docker](https://docker.io)** for container management and environment isolation on the development box, and **[Jenkins](https://jenkins.io)** for automated and monitored DevOps."
  },
  {
    "title": "Web Development",
    "background": "assets/images/softwareDevelopment-a.jpg",
    "description": "Your business web site can be your fingerprint, your business card, your showroom and your marketplace./n/nWhatever you want from this *portal*, you should continually keep an eye on it to preserve it up-to-date and prestigious./n/nNew paradigm in web development outdated many web sites that were thought to be great and well-designed at their era. To name a few: /n* convenience of *Single Page Application* **(SPA)**,/n* improvements to *User Experience* **(UX)** through  well-thought and usable *User Interface* **(UI)** themes and components, and /n* an ever-growing and unforgiving requirement for the web pages to be **responsive**, i.e. to neatly load and accommodate on mobile browsers./n/nWe know these new requirements well, and can guide you in launching or refurbishing your web site or building it afresh."
  },
  {
    "title": "Software Development",
    "background": "assets/images/web-development-a.jpg",
    "description": "Today the systems, their users and their sources of data are more and more distributed. Everyone and everything is now expected to be live on the Internet (**web** or **IoT**), and they need to be served by powerful servers to receive, process and store their data, to receive and emit notifications where required and to provide well-formed summaries of the information overload./n/nA useful software, whether for an enterprise or an individual, needs to address this connected world. Therefore software has become more like **apps**: with a *reactive* logic on a connected server, with modularised Application Programming Interfaces **(APIs)** that can be connected to and consumed as a **microservices** by other servers, and with *loose-coupling* to a web or mobile app interface that can be interchangeably used by the users./n/nWe gained considerable expertise in designing, implementing and deployment of software in this way, and we have had satisfied clients in enterprise level."
  },
  {
    "title": "Technical Support",
    "background": "assets/images/technical-support.png",
    "description": "Software ages like the live beasts, and without well-thought prospect of training, support, maintenance and occasional upgrades, it will die soon, or worse, it will be stillborn./n/nThe product launch day is the end of an intense development period for the programmers, but it is just the first day of 'release to production', when the product owner starts using it and usually needs 24/7 support. /n/nWe offer an Server Level Agreement **(SLA)** to our clients: the support starts with training, to help the owner understand and become skillful in using the new tool./n/nIt continues with active monitoring of the servers. An open channel is designated for the client to send feedbacks in form of bug-reporting or request of new features, and push-buttons to sound the sirens for the costly incidents like server failures and possible data loss or leaks./n/nThe channels are complimented with phone-calls, on-screen sessions, on-site presence and face to face chats to understand the issue and resolve it faster./n/nWe take support of our products seriously. The development job is a long-term commitment, so we write the code and error-handling to be supportable and clear to solve. We test the code under simulations of the real use cases, to make sure it is okay - but as long as there is code, there is bug and issues, and they must be addressed as rigorously - if not more."
  },
  {
    "meta": {
      "keywords": "Bent Oak Systems,CI/CD,Web Development,Software Development,Technical Support",
      "descriptions": "About Bent Oak Systems"
    }
  }
]