{
  "backgroundPic": "assets/images/home-banner.jpg",
  "text_on_background": "Bent Oak Systems",
  "introRes": {
    "introEn": "\n # App Developers\n\nDecades of progress in Information and Communication Technologies provided creative souls with great fabric of the Web, the mobile and social computing, and a huge wealth of free, accessible and open-source programmatic toolset that was not imaginable even a few years ago.\n\nModern apps are combination of all these possibilities rammed into an easy-to-use, intuitive, usually hand-held gizmo for daily use.\n\nIn Bent Oak Systems we strive to create good apps for our clients. We create them on the Web, and on various Mobile ecosystems, and we create well-thought micro-services and data stores to support them.\n\nIn short we are software architects, designers and programmers focused on apps.\n\n## Thinking globally, acting locally\n\nWith global partners in London, UK, we are a global software development team with high standards for quality and delivery.\n\nOn the other hand, we proudly use our local advantages: a dynamic startup environment in Tehran that generates lots of talented developers, and with inexpensive cost of living that enables us to reduce our cost of develpment to fraction and make real value for money.\n",
    "introFa": "\n# اپ سازان\n \nدهه‌ها رشد در فناوری اطلاعات و ارتباطات باعث شده ساختار وب، محاسبات به شکل موبایل و اجتماعی، و حجم عظیمی از نرم‌افزارهای متن‌باز در اختیار آدم‌های خلاق قرار بگیرد. چیزی که تا چند سال قبل قابل تصور نبود.\n\nاپلیکیشن‌های امروزی ترکیبی از تمام این امکانات هستند که در یک ابزار خوش‌دست برای کاربرد روزانه فشرده شده است.\n\nدر بُنـتوک سـامانه کوشش ما در ساختن اپ خوب برای مشتری است. ما اپلیکیشن را روی وب، و روی محیط‌های کاربری مختلف موبایل می‌سازیم؛ برای پشتیبانی اپ‌ها پایگاه‌های داده و میکروسرویس‌های خوش‌ساخت و مقیاس‌پذیر را پیاده می‌کنیم.\n\nخلاصه ما معمار، طراح و نویسنده‌ی نرم‌افزار هستیم. با تمرکز ویژه بر ساخت اپلیکیشن (افزارک) ها.\n\n## فکر جهانی، عملکرد محلی\n\nبا داشتن پایگاه و مشتری در لندن، ما تیم نرم‌افزاری با استانداردهای جهانی در کیفیت و تحویل محصول هستیم.\n\nهم‌زمان ما از مزیت‌های خودمان به عنوان یک تیم ایرانی بهره‌مندیم. فضای استارتاپی جذاب در تهران برنامه‌نویسان با استعداد زیادی تربیت کرده و سبک زندگی به نسبت ارزان‌تر باعث شده قیمت تمام‌شده‌ی ما رقابتی‌تر باشد.\n"
  }
}